# Exercise 4.9 Part 1

## Step 1: Import Libraies and Load Data

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
from os.path import join

In [3]:
# set the path
ORIGINAL_DATA_PATH = "../Original Data"

In [4]:
# set path to original data
customer_df = pd.read_csv("../Original Data/customers.csv")

In [5]:
# loading data
customer_df = pd.read_csv(join(ORIGINAL_DATA_PATH, "customers.csv"))

## Step 2: Initial Exploration

In [6]:
# view basic info
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [7]:
# view first few rows
customer_df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Step 3: Clean and Wrangle the Data

In [8]:
# Rename Columns for calarity
customer_df.rename(columns = {'user_id' : 'customer_id', 'First Name' : 'first_name', 'Surnam' : 'surname',
                              'Gender': 'gender', 'STATE' : 'state', 'Age' : 'age','n_dependants' : 'num_dependents',
                              'fam_status' : 'family_status'}, inplace= True)

In [9]:
# cross check
customer_df.head()

,customer_id,first_name,surname,gender,state,age,date_joined,num_dependents,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
# Check for duplicates
customer_df.duplicated().sum()

np.int64(0)

In [11]:
# check for missing values
customer_df.isnull().sum()

customer_id           0
first_name        11259
surname               0
gender                0
state                 0
age                   0
date_joined           0
num_dependents        0
family_status         0
income                0
dtype: int64

In [12]:
# Drop rows missing values
customer_df = customer_df.dropna(subset=['first_name'])

In [13]:
# check for clean data
customer_df.isnull().sum()

customer_id       0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
num_dependents    0
family_status     0
income            0
dtype: int64

In [14]:
customer_df.shape

(194950, 10)

In [15]:
print(customer_df.dtypes)

customer_id        int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
num_dependents     int64
family_status     object
income             int64
dtype: object

In [16]:
# Convert data_joined to datetime
customer_df['date_joined'] = pd.to_datetime(customer_df['date_joined'])

In [17]:
customer_df.head()

,customer_id,first_name,surname,gender,state,age,date_joined,num_dependents,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,2017-01-01,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2017-01-01,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,2017-01-01,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,2017-01-01,1,married,40374

In [18]:
# Ensure customer_id is string for merging
customer_df['customer_id'] = customer_df['customer_id'].astype(str)

In [19]:
customer_df['customer_id'].dtype

dtype('O')

In [20]:
customer_df.info

<bound method DataFrame.info of        customer_id first_name   surname  gender           state  age  \
0            26711    Deborah  Esquivel  Female        Missouri   48
1            33890   Patricia      Hart  Female      New Mexico   36
2            65803    Kenneth    Farley    Male           Idaho   35
3           125935   Michelle     Hicks  Female            Iowa   40
4           130797        Ann   Gilmore  Female        Maryland   26
...            ...        ...       ...     ...             ...  ...
206204      168073       Lisa      Case  Female  North Carolina   44
206205       49635     Jeremy   Robbins    Male          Hawaii   62
206206      135902      Doris  Richmond  Female        Missouri   66
206207       81095       Rose   Rollins  Female      California   27
206208       80148    Cynthia     Noble  Female        New York   55

       date_joined  num_dependents family_status  income
0       2017-01-01               3       married  165665
1       2017-01-01               0        single   59285
2       2017-01-01               2       married   99568
3       2017-01-01               0        single   42049
4       2017-01-01               1       married   40374
...            ...             ...           ...     ...
206204  2020-04-01               1       married  148828
206205  2020-04-01               3       married  168639
206206  2020-04-01               2       married   53374
206207  2020-04-01               1       married   99799
206208  2020-04-01               1       married   57095

[194950 rows x 10 columns]>

In [21]:
# export files
customer_df.to_pickle(os.path.join(ORIGINAL_DATA_PATH,'customers_clean.pkl'))